{
  "backend/main.mo": "Defines the main backend actor with access control, storage mixins, user, student, staff, finance, exams, SMS, and audit log types, plus authorization helpers.",
  "feature_evidence.json": "Lists feature evidence entries mapping implemented features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their roles in the application.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads the React app root and main script.",
  "frontend/src/App.tsx": "Main React app wiring authentication, routing, layout, and all module pages with auto-logout support.",
  "frontend/src/components/admin/BackupReminderBanner.tsx": "React banner component showing a periodic backup reminder using localStorage and navigation to backup page.",
  "frontend/src/components/admin/UserFormDialog.tsx": "Dialog form for creating a new user, handling input, validation, and submission via useCreateUser.",
  "frontend/src/components/admissions/StudentFormDialog.tsx": "Dialog for creating or editing a student record, including personal details, class info, parent contacts, and photo upload.",
  "frontend/src/components/auth/LogoutButton.tsx": "Button that logs out the user by clearing identity data and React Query cache.",
  "frontend/src/components/auth/RequireRole.tsx": "Wrapper that restricts access to children based on allowed user roles and shows an error message if unauthorized.",
  "frontend/src/components/exams/MarksEntryFormDialog.tsx": "Dialog for adding exam marks, calculating grade, and submitting a new ExamRecord.",
  "frontend/src/components/files/PhotoUploader.tsx": "Component for uploading and previewing a photo using ExternalBlob with progress tracking.",
  "frontend/src/components/finance/FinancialRecordFormDialog.tsx": "Dialog for adding revenue or expense records with amount, description, and timestamp.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout containing header, sidebar, offline banner, content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying school info, contact details, copyright, and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Header showing app title, user role badge, user name, and logout button.",
  "frontend/src/components/layout/SidebarNav.tsx": "Renders a role‑aware sidebar navigation menu, showing links based on the current user's appRole and highlighting the active route.",
  "frontend/src/components/offline/OfflineStatusBanner.tsx": "Displays an offline alert banner when the app detects loss of network connectivity.",
  "frontend/src/components/sms/SMSTemplates.ts": "Provides predefined SMS templates and a helper to insert dynamic placeholder values into template text.",
  "frontend/src/components/staff/StaffFormDialog.tsx": "Modal dialog for creating or editing staff records, handling form state, photo upload, and submit mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current authenticated user's profile using the actor, exposing loading and refetch states.",
  "frontend/src/hooks/useDashboardStats.ts": "Computes dashboard metrics such as total active students, staff, classes, and fee totals based on fetched data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines query and mutation hooks for students, staff, and other backend resources using the actor and React Query.",
  "frontend/src/index.css": "Tailwind CSS configuration defining design tokens, dark mode variables, and print-specific styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/offline/useOfflineStatus.ts": "Tracks online/offline browser status and exposes a simple hook returning connection state.",
  "frontend/src/pages/admin/AuditTrailPage.tsx": "Admin page for headmasters to view audit logs in a table with timestamps, users, and actions.",
  "frontend/src/pages/admin/BackupRestorePage.tsx": "Admin interface for exporting and importing full system backups with file handling and status toasts.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Headmaster-only page listing users, adding new ones, and disabling existing accounts.",
  "frontend/src/pages/admissions/AdmissionsPage.tsx": "Admissions management page enabling student search, creation, viewing, and deletion with role restrictions.",
  "frontend/src/pages/admissions/StudentDetailPage.tsx": "Displays detailed student info with actions to print, transfer, or dismiss a student using query hooks.",
  "frontend/src/pages/ChangePasswordPage.tsx": "React page providing a password change form with basic client-side validation and success/error alerts.",
  "frontend/src/pages/classes/ClassDetailPage.tsx": "Shows all students in a selected class with a printable table of their details.",
  "frontend/src/pages/classes/ClassesPage.tsx": "Lists all classes with student counts, search, print, and CSV export features.",
  "frontend/src/pages/classes/ParentsPage.tsx": "Aggregates parents from student data and lists them with search, print, and CSV export options.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing user greeting, backup reminder, and key school statistics with loading states.",
  "frontend/src/pages/exams/AnalyticsPage.tsx": "Generates subject-wise average marks and displays them in a bar chart for exam analytics.",
  "frontend/src/pages/exams/ExamsPage.tsx": "Manages exam records with listing, deletion, marks entry dialog, and navigation to analytics and report cards.",
  "frontend/src/pages/exams/StudentReportCardPage.tsx": "Displays a student’s exam records, calculates average marks, and provides print/download options.",
  "frontend/src/pages/finance/FinancePage.tsx": "Shows revenue and expense records with tabs, allows adding and deleting records, and links to financial reports.",
  "frontend/src/pages/finance/ReceiptPage.tsx": "Renders a printable receipt for a specific financial record with amount, date, and description.",
  "frontend/src/pages/finance/ReportsPage.tsx": "Generates financial summaries and charts comparing revenue and expenses, with print support.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that triggers Internet Identity authentication and displays errors or loading state.",
  "frontend/src/pages/sms/SMSHistoryPage.tsx": "Lists SMS logs with timestamps, receiver info, message previews, and delivery status.",
  "frontend/src/pages/sms/SMSPage.tsx": "Provides interfaces to send simulated individual or bulk SMS messages with templates and logs.",
  "frontend/src/pages/staff/StaffDetailPage.tsx": "Shows detailed staff information including photo, position, and status, with print functionality.",
  "frontend/src/pages/staff/StaffDirectoryPage.tsx": "Renders a staff directory with search, add, view, and delete actions, loading staff via hooks and restricting access to headmasters.",
  "frontend/src/security/useAutoLogout.ts": "Implements an inactivity timer that logs out the user and clears React Query cache after 30 minutes of no input events.",
  "frontend/src/utils/export.ts": "Exports an array of objects to a downloadable CSV file by generating and triggering a blob download.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Defines the project's state, architecture notes, required images, and existing implemented features for the school management system."
}